[
  {
    "id": "comprehensive-nativescript-with-angular",
    "code": "NSNG-144",
    "version": "1.0",
    "length": "5 Days",
    "price": 2500,
    "order": 1000,
    "flavors": ["Angular"],
    "label": "NEW",
    "title": "Comprehensive NativeScript with Angular",
    "subtitle": "",
    "descriptionHtml":
      "NativeScripting’s Comprehensive NativeScript with Angular bootcamp teaches students the basic and advanced skills they need to design, build, and test sophisticated native mobile applications that function well on iOS and Android operating systems. <h5>What you'll learn</h5><p>Actively gathering and applying Knowledge makes us thinkers with a distinctive and informed point of view. We are constantly anticipating market trends and translating them into opportunities and progress, for our clients and for ourselves.anticipating market trends and translating them into.</p><ul><li>Over the past year, U.S. consumers struggled through the clunky,multiscreen experience that is an EMV transaction. Consumers waited</li><li>Our deep understanding of project and program management has enabled the success of our clients’ large initiatives. Capco can provide expertise at every level.</li><li>We are transparent, honest and consistent in all we do. We take pride in our work and act with professionalism. At all times and in every situation.</li><li>Commitment comes to life through being passionate about solving complex business problems and helping shape the next generation of financial services.{' '}</li></ul>",
    "prerequisites":
      "All attendees must have substantial prior experience developing with JavaScript and TypeScript. If attendees will not have prior TypeScript experience, we would be delighted to precede this class with a one- or two-day intensive TypeScript primer.",
    "products": [
      {
        "title": "NativeScript"
      },
      {
        "title": "Angular"
      },
      {
        "title": "TypeScript"
      }
    ],
    "audience": [
      {
        "title": "Developers"
      }
    ],
    "curriculum": [
      {
        "id": 1,
        "title": "Intro to course",
        "description": "desc",
        "topics": [
          {
            "id": 1,
            "title": "topic 1"
          }
        ],
        "labsHtml":
          "<ul><li>Exercise 1: Create a Power BI Development Environment</li><li>Exercise 2: Get Up and Running with Power BI Desktop</li><li>Exercise 3: Create a New App Workspace for a Custom Solution</li><li>Exercise 4: Publish PBIX Project Files to the Power BI Service</li></ul>"
      },
      {
        "id": 2,
        "title": "Getting Started",
        "description": "desc",
        "topics": [
          {
            "id": 1,
            "title": "topic 1"
          },
          {
            "id": 2,
            "title": "topic 2"
          }
        ],
        "labsHtml":
          "<ul><li>Exercise 1: Create a Power BI Development Environment</li><li>Exercise 2: Get Up and Running with Power BI Desktop</li><li>Exercise 3: Create a New App Workspace for a Custom Solution</li><li>Exercise 4: Publish PBIX Project Files to the Power BI Service</li></ul>"
      }
    ]
  }
]
